vdtruong/temp_rh/mc9s08lc60.h
#define APCTL1_ADPC0_MASK               1
#define APCTL1_ADPC1_MASK               2
#define APCTL1_ADPC2_MASK               4
#define APCTL1_ADPC3_MASK               8
#define APCTL1_ADPC4_MASK               16
#define APCTL1_ADPC5_MASK               32
#define APCTL1_ADPC6_MASK               64
#define APCTL1_ADPC7_MASK               128


/*** IICA - IIC Address Register; 0x00000018 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte ADDR0       :1;                                       /* IIC Address Bit 0 */
    byte ADDR1       :1;                                       /* IIC Address Bit 1 */
    byte ADDR2       :1;                                       /* IIC Address Bit 2 */
    byte ADDR3       :1;                                       /* IIC Address Bit 3 */
    byte ADDR4       :1;                                       /* IIC Address Bit 4 */
    byte ADDR5       :1;                                       /* IIC Address Bit 5 */
    byte ADDR6       :1;                                       /* IIC Address Bit 6 */
  } Bits;
  struct {
    byte         :1;
    byte grpADDR :7;
  } MergedBits;
} IICASTR;
extern volatile IICASTR _IICA @0x00000018;
#define IICA                            _IICA.Byte
#define IICA_ADDR0                      _IICA.Bits.ADDR0
#define IICA_ADDR1                      _IICA.Bits.ADDR1
#define IICA_ADDR2                      _IICA.Bits.ADDR2
#define IICA_ADDR3                      _IICA.Bits.ADDR3
#define IICA_ADDR4                      _IICA.Bits.ADDR4
#define IICA_ADDR5                      _IICA.Bits.ADDR5
#define IICA_ADDR6                      _IICA.Bits.ADDR6
#define IICA_ADDR                       _IICA.MergedBits.grpADDR

#define IICA_ADDR0_MASK                 2
#define IICA_ADDR1_MASK                 4
#define IICA_ADDR2_MASK                 8
#define IICA_ADDR3_MASK                 16
#define IICA_ADDR4_MASK                 32
#define IICA_ADDR5_MASK                 64
#define IICA_ADDR6_MASK                 128
#define IICA_ADDR_MASK                  254
#define IICA_ADDR_BITNUM                1


/*** IICF - IIC Frequency Divider Register; 0x00000019 ***/
typedef union {
  byte Byte;
  struct {
    byte ICR0        :1;                                       /* IIC Clock Rate Bit 0 */
    byte ICR1        :1;                                       /* IIC Clock Rate Bit 1 */
    byte ICR2        :1;                                       /* IIC Clock Rate Bit 2 */
    byte ICR3        :1;                                       /* IIC Clock Rate Bit 3 */
    byte ICR4        :1;                                       /* IIC Clock Rate Bit 4 */
    byte ICR5        :1;                                       /* IIC Clock Rate Bit 5 */
    byte MULT0       :1;                                       /* Multiplier Factor Bit 0 */
    byte MULT1       :1;                                       /* Multiplier Factor Bit 1 */
  } Bits;
  struct {
    byte grpICR  :6;
    byte grpMULT :2;
  } MergedBits;
} IICFSTR;
extern volatile IICFSTR _IICF @0x00000019;
#define IICF                            _IICF.Byte
#define IICF_ICR0                       _IICF.Bits.ICR0
#define IICF_ICR1                       _IICF.Bits.ICR1
#define IICF_ICR2                       _IICF.Bits.ICR2
#define IICF_ICR3                       _IICF.Bits.ICR3
#define IICF_ICR4                       _IICF.Bits.ICR4
#define IICF_ICR5                       _IICF.Bits.ICR5
#define IICF_MULT0                      _IICF.Bits.MULT0
#define IICF_MULT1                      _IICF.Bits.MULT1
#define IICF_ICR                        _IICF.MergedBits.grpICR
#define IICF_MULT                       _IICF.MergedBits.grpMULT

#define IICF_ICR0_MASK                  1
#define IICF_ICR1_MASK                  2
#define IICF_ICR2_MASK                  4
#define IICF_ICR3_MASK                  8
#define IICF_ICR4_MASK                  16
#define IICF_ICR5_MASK                  32
#define IICF_MULT0_MASK                 64
#define IICF_MULT1_MASK                 128
#define IICF_ICR_MASK                   63
#define IICF_ICR_BITNUM                 0
#define IICF_MULT_MASK                  192
#define IICF_MULT_BITNUM                6


/*** IICC - IIC Control Register; 0x0000001A ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte RSTA        :1;                                       /* Repeat START Bit */
    byte TXAK        :1;                                       /* Transmit Acknowledge Enable Bit */
    byte TX          :1;                                       /* Transmit Mode Select Bit */
    byte MST         :1;                                       /* Master Mode Select Bit */
    byte IICIE       :1;                                       /* IIC Interrupt Enable Bit */
    byte IICEN       :1;                                       /* IIC Enable Bit */
  } Bits;
} IICCSTR;
extern volatile IICCSTR _IICC @0x0000001A;
#define IICC                            _IICC.Byte
#define IICC_RSTA                       _IICC.Bits.RSTA
#define IICC_TXAK                       _IICC.Bits.TXAK
#define IICC_TX                         _IICC.Bits.TX
#define IICC_MST                        _IICC.Bits.MST
#define IICC_IICIE                      _IICC.Bits.IICIE
#define IICC_IICEN                      _IICC.Bits.IICEN

#define IICC_RSTA_MASK                  4
#define IICC_TXAK_MASK                  8
#define IICC_TX_MASK                    16
#define IICC_MST_MASK                   32
#define IICC_IICIE_MASK                 64
#define IICC_IICEN_MASK                 128


/*** IICS - IIC Status Register; 0x0000001B ***/
typedef union {
  byte Byte;
  struct {
    byte RXAK        :1;                                       /* Receive Acknowledge */
    byte IICIF       :1;                                       /* IIC Interrupt Flag */
    byte SRW         :1;                                       /* Slave Read/Write */
    byte             :1; 
    byte ARBL        :1;                                       /* Arbitration Lost */
    byte BUSY        :1;                                       /* Bus Busy bit */
    byte IAAS        :1;                                       /* Addressed as a Slave Bit */
    byte TCF         :1;                                       /* Transfer Complete Flag */
  } Bits;
} IICSSTR;
