vdtruong/temp_rh/mc9s08lc60.h
#define FPENR4_FP32EN_MASK              1
#define FPENR4_FP33EN_MASK              2
#define FPENR4_FP34EN_MASK              4
#define FPENR4_FP35EN_MASK              8
#define FPENR4_FP36EN_MASK              16
#define FPENR4_FP37EN_MASK              32
#define FPENR4_FP38EN_MASK              64
#define FPENR4_FP39EN_MASK              128


/*** FPENR5 - LCD Frontplane Enable Registers 5; 0x00001847 ***/
typedef union {
  byte Byte;
  struct {
    byte FP40EN      :1;                                       /* Frontplane Output Enable Bit 40 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} FPENR5STR;
extern volatile FPENR5STR _FPENR5 @0x00001847;
#define FPENR5                          _FPENR5.Byte
#define FPENR5_FP40EN                   _FPENR5.Bits.FP40EN

#define FPENR5_FP40EN_MASK              1


/*** LCDRAM0 - LCDRAM Register 0; 0x00001848 ***/
typedef union {
  byte Byte;
  struct {
    byte FP0BP0      :1;                                       /* LCD Segment 0 Data Bit 0 */
    byte FP0BP1      :1;                                       /* LCD Segment 0 Data Bit 1 */
    byte FP0BP2      :1;                                       /* LCD Segment 0 Data Bit 2 */
    byte FP0BP3      :1;                                       /* LCD Segment 0 Data Bit 3 */
    byte FP1BP0      :1;                                       /* LCD Segment 1 Data Bit 0 */
    byte FP1BP1      :1;                                       /* LCD Segment 1 Data Bit 1 */
    byte FP1BP2      :1;                                       /* LCD Segment 1 Data Bit 2 */
    byte FP1BP3      :1;                                       /* LCD Segment 1 Data Bit 3 */
  } Bits;
  struct {
    byte grpFP0BP :4;
    byte grpFP1BP :4;
  } MergedBits;
} LCDRAM0STR;
extern volatile LCDRAM0STR _LCDRAM0 @0x00001848;
#define LCDRAM0                         _LCDRAM0.Byte
#define LCDRAM0_FP0BP0                  _LCDRAM0.Bits.FP0BP0
#define LCDRAM0_FP0BP1                  _LCDRAM0.Bits.FP0BP1
#define LCDRAM0_FP0BP2                  _LCDRAM0.Bits.FP0BP2
#define LCDRAM0_FP0BP3                  _LCDRAM0.Bits.FP0BP3
#define LCDRAM0_FP1BP0                  _LCDRAM0.Bits.FP1BP0
#define LCDRAM0_FP1BP1                  _LCDRAM0.Bits.FP1BP1
#define LCDRAM0_FP1BP2                  _LCDRAM0.Bits.FP1BP2
#define LCDRAM0_FP1BP3                  _LCDRAM0.Bits.FP1BP3
/* LCDRAM_ARR: Access 21 LCDRAMx registers in an array */
#define LCDRAM_ARR                      ((volatile byte * __far) &LCDRAM0)
#define LCDRAM0_FP0BP                   _LCDRAM0.MergedBits.grpFP0BP
#define LCDRAM0_FP1BP                   _LCDRAM0.MergedBits.grpFP1BP

#define LCDRAM0_FP0BP0_MASK             1
#define LCDRAM0_FP0BP1_MASK             2
#define LCDRAM0_FP0BP2_MASK             4
#define LCDRAM0_FP0BP3_MASK             8
#define LCDRAM0_FP1BP0_MASK             16
#define LCDRAM0_FP1BP1_MASK             32
#define LCDRAM0_FP1BP2_MASK             64
#define LCDRAM0_FP1BP3_MASK             128
#define LCDRAM0_FP0BP_MASK              15
#define LCDRAM0_FP0BP_BITNUM            0
#define LCDRAM0_FP1BP_MASK              240
#define LCDRAM0_FP1BP_BITNUM            4


/*** LCDRAM1 - LCDRAM Register 1; 0x00001849 ***/
typedef union {
  byte Byte;
  struct {
    byte FP2BP0      :1;                                       /* LCD Segment 2 Data Bit 0 */
    byte FP2BP1      :1;                                       /* LCD Segment 2 Data Bit 1 */
    byte FP2BP2      :1;                                       /* LCD Segment 2 Data Bit 2 */
    byte FP2BP3      :1;                                       /* LCD Segment 2 Data Bit 3 */
    byte FP3BP0      :1;                                       /* LCD Segment 3 Data Bit 0 */
    byte FP3BP1      :1;                                       /* LCD Segment 3 Data Bit 1 */
    byte FP3BP2      :1;                                       /* LCD Segment 3 Data Bit 2 */
    byte FP3BP3      :1;                                       /* LCD Segment 3 Data Bit 3 */
  } Bits;
  struct {
    byte grpFP2BP :4;
    byte grpFP3BP :4;
  } MergedBits;
} LCDRAM1STR;
extern volatile LCDRAM1STR _LCDRAM1 @0x00001849;
#define LCDRAM1                         _LCDRAM1.Byte
#define LCDRAM1_FP2BP0                  _LCDRAM1.Bits.FP2BP0
#define LCDRAM1_FP2BP1                  _LCDRAM1.Bits.FP2BP1
#define LCDRAM1_FP2BP2                  _LCDRAM1.Bits.FP2BP2
#define LCDRAM1_FP2BP3                  _LCDRAM1.Bits.FP2BP3
#define LCDRAM1_FP3BP0                  _LCDRAM1.Bits.FP3BP0
#define LCDRAM1_FP3BP1                  _LCDRAM1.Bits.FP3BP1
#define LCDRAM1_FP3BP2                  _LCDRAM1.Bits.FP3BP2
#define LCDRAM1_FP3BP3                  _LCDRAM1.Bits.FP3BP3
#define LCDRAM1_FP2BP                   _LCDRAM1.MergedBits.grpFP2BP
#define LCDRAM1_FP3BP                   _LCDRAM1.MergedBits.grpFP3BP

#define LCDRAM1_FP2BP0_MASK             1
#define LCDRAM1_FP2BP1_MASK             2
#define LCDRAM1_FP2BP2_MASK             4
#define LCDRAM1_FP2BP3_MASK             8
#define LCDRAM1_FP3BP0_MASK             16
#define LCDRAM1_FP3BP1_MASK             32
#define LCDRAM1_FP3BP2_MASK             64
#define LCDRAM1_FP3BP3_MASK             128
#define LCDRAM1_FP2BP_MASK              15
#define LCDRAM1_FP2BP_BITNUM            0
#define LCDRAM1_FP3BP_MASK              240
#define LCDRAM1_FP3BP_BITNUM            4


/*** LCDRAM2 - LCDRAM Register 2; 0x0000184A ***/
typedef union {
  byte Byte;
  struct {
    byte FP4BP0      :1;                                       /* LCD Segment 4 Data Bit 0 */
    byte FP4BP1      :1;                                       /* LCD Segment 4 Data Bit 1 */
    byte FP4BP2      :1;                                       /* LCD Segment 4 Data Bit 2 */
    byte FP4BP3      :1;                                       /* LCD Segment 4 Data Bit 3 */
    byte FP5BP0      :1;                                       /* LCD Segment 5 Data Bit 0 */
    byte FP5BP1      :1;                                       /* LCD Segment 5 Data Bit 1 */
    byte FP5BP2      :1;                                       /* LCD Segment 5 Data Bit 2 */
    byte FP5BP3      :1;                                       /* LCD Segment 5 Data Bit 3 */
  } Bits;
  struct {
    byte grpFP4BP :4;
    byte grpFP5BP :4;
  } MergedBits;
} LCDRAM2STR;
extern volatile LCDRAM2STR _LCDRAM2 @0x0000184A;
#define LCDRAM2                         _LCDRAM2.Byte
#define LCDRAM2_FP4BP0                  _LCDRAM2.Bits.FP4BP0
#define LCDRAM2_FP4BP1                  _LCDRAM2.Bits.FP4BP1
#define LCDRAM2_FP4BP2                  _LCDRAM2.Bits.FP4BP2
#define LCDRAM2_FP4BP3                  _LCDRAM2.Bits.FP4BP3
#define LCDRAM2_FP5BP0                  _LCDRAM2.Bits.FP5BP0
#define LCDRAM2_FP5BP1                  _LCDRAM2.Bits.FP5BP1
#define LCDRAM2_FP5BP2                  _LCDRAM2.Bits.FP5BP2
#define LCDRAM2_FP5BP3                  _LCDRAM2.Bits.FP5BP3
#define LCDRAM2_FP4BP                   _LCDRAM2.MergedBits.grpFP4BP
#define LCDRAM2_FP5BP                   _LCDRAM2.MergedBits.grpFP5BP

#define LCDRAM2_FP4BP0_MASK             1
#define LCDRAM2_FP4BP1_MASK             2
#define LCDRAM2_FP4BP2_MASK             4
#define LCDRAM2_FP4BP3_MASK             8
#define LCDRAM2_FP5BP0_MASK             16
#define LCDRAM2_FP5BP1_MASK             32
#define LCDRAM2_FP5BP2_MASK             64
#define LCDRAM2_FP5BP3_MASK             128
#define LCDRAM2_FP4BP_MASK              15
#define LCDRAM2_FP4BP_BITNUM            0
#define LCDRAM2_FP5BP_MASK              240
#define LCDRAM2_FP5BP_BITNUM            4


/*** LCDRAM3 - LCDRAM Register 3; 0x0000184B ***/
typedef union {
  byte Byte;
  struct {
    byte FP6BP0      :1;                                       /* LCD Segment 6 Data Bit 0 */
    byte FP6BP1      :1;                                       /* LCD Segment 6 Data Bit 1 */
    byte FP6BP2      :1;                                       /* LCD Segment 6 Data Bit 2 */
    byte FP6BP3      :1;                                       /* LCD Segment 6 Data Bit 3 */
    byte FP7BP0      :1;                                       /* LCD Segment 7 Data Bit 0 */
    byte FP7BP1      :1;                                       /* LCD Segment 7 Data Bit 1 */
    byte FP7BP2      :1;                                       /* LCD Segment 7 Data Bit 2 */
    byte FP7BP3      :1;                                       /* LCD Segment 7 Data Bit 3 */
  } Bits;
  struct {
    byte grpFP6BP :4;
    byte grpFP7BP :4;
  } MergedBits;
} LCDRAM3STR;
