vdtruong/temp_rh/mc9s08lc60.h
extern volatile LCDRAM3STR _LCDRAM3 @0x0000184B;
#define LCDRAM3                         _LCDRAM3.Byte
#define LCDRAM3_FP6BP0                  _LCDRAM3.Bits.FP6BP0
#define LCDRAM3_FP6BP1                  _LCDRAM3.Bits.FP6BP1
#define LCDRAM3_FP6BP2                  _LCDRAM3.Bits.FP6BP2
#define LCDRAM3_FP6BP3                  _LCDRAM3.Bits.FP6BP3
#define LCDRAM3_FP7BP0                  _LCDRAM3.Bits.FP7BP0
#define LCDRAM3_FP7BP1                  _LCDRAM3.Bits.FP7BP1
#define LCDRAM3_FP7BP2                  _LCDRAM3.Bits.FP7BP2
#define LCDRAM3_FP7BP3                  _LCDRAM3.Bits.FP7BP3
#define LCDRAM3_FP6BP                   _LCDRAM3.MergedBits.grpFP6BP
#define LCDRAM3_FP7BP                   _LCDRAM3.MergedBits.grpFP7BP

#define LCDRAM3_FP6BP0_MASK             1
#define LCDRAM3_FP6BP1_MASK             2
#define LCDRAM3_FP6BP2_MASK             4
#define LCDRAM3_FP6BP3_MASK             8
#define LCDRAM3_FP7BP0_MASK             16
#define LCDRAM3_FP7BP1_MASK             32
#define LCDRAM3_FP7BP2_MASK             64
#define LCDRAM3_FP7BP3_MASK             128
#define LCDRAM3_FP6BP_MASK              15
#define LCDRAM3_FP6BP_BITNUM            0
#define LCDRAM3_FP7BP_MASK              240
#define LCDRAM3_FP7BP_BITNUM            4


/*** LCDRAM4 - LCDRAM Register 4; 0x0000184C ***/
typedef union {
  byte Byte;
  struct {
    byte FP8BP0      :1;                                       /* LCD Segment 8 Data Bit 0 */
    byte FP8BP1      :1;                                       /* LCD Segment 8 Data Bit 1 */
    byte FP8BP2      :1;                                       /* LCD Segment 8 Data Bit 2 */
    byte FP8BP3      :1;                                       /* LCD Segment 8 Data Bit 3 */
    byte FP9BP0      :1;                                       /* LCD Segment 9 Data Bit 0 */
    byte FP9BP1      :1;                                       /* LCD Segment 9 Data Bit 1 */
    byte FP9BP2      :1;                                       /* LCD Segment 9 Data Bit 2 */
    byte FP9BP3      :1;                                       /* LCD Segment 9 Data Bit 3 */
  } Bits;
  struct {
    byte grpFP8BP :4;
    byte grpFP9BP :4;
  } MergedBits;
} LCDRAM4STR;
extern volatile LCDRAM4STR _LCDRAM4 @0x0000184C;
#define LCDRAM4                         _LCDRAM4.Byte
#define LCDRAM4_FP8BP0                  _LCDRAM4.Bits.FP8BP0
#define LCDRAM4_FP8BP1                  _LCDRAM4.Bits.FP8BP1
#define LCDRAM4_FP8BP2                  _LCDRAM4.Bits.FP8BP2
#define LCDRAM4_FP8BP3                  _LCDRAM4.Bits.FP8BP3
#define LCDRAM4_FP9BP0                  _LCDRAM4.Bits.FP9BP0
#define LCDRAM4_FP9BP1                  _LCDRAM4.Bits.FP9BP1
#define LCDRAM4_FP9BP2                  _LCDRAM4.Bits.FP9BP2
#define LCDRAM4_FP9BP3                  _LCDRAM4.Bits.FP9BP3
#define LCDRAM4_FP8BP                   _LCDRAM4.MergedBits.grpFP8BP
#define LCDRAM4_FP9BP                   _LCDRAM4.MergedBits.grpFP9BP

#define LCDRAM4_FP8BP0_MASK             1
#define LCDRAM4_FP8BP1_MASK             2
#define LCDRAM4_FP8BP2_MASK             4
#define LCDRAM4_FP8BP3_MASK             8
#define LCDRAM4_FP9BP0_MASK             16
#define LCDRAM4_FP9BP1_MASK             32
#define LCDRAM4_FP9BP2_MASK             64
#define LCDRAM4_FP9BP3_MASK             128
#define LCDRAM4_FP8BP_MASK              15
#define LCDRAM4_FP8BP_BITNUM            0
#define LCDRAM4_FP9BP_MASK              240
#define LCDRAM4_FP9BP_BITNUM            4


/*** LCDRAM5 - LCDRAM Register 5; 0x0000184D ***/
typedef union {
  byte Byte;
  struct {
    byte FP10BP0     :1;                                       /* LCD Segment 10 Data Bit 0 */
    byte FP10BP1     :1;                                       /* LCD Segment 10 Data Bit 1 */
    byte FP10BP2     :1;                                       /* LCD Segment 10 Data Bit 2 */
    byte FP10BP3     :1;                                       /* LCD Segment 10 Data Bit 3 */
    byte FP11BP0     :1;                                       /* LCD Segment 11 Data Bit 0 */
    byte FP11BP1     :1;                                       /* LCD Segment 11 Data Bit 1 */
    byte FP11BP2     :1;                                       /* LCD Segment 11 Data Bit 2 */
    byte FP11BP3     :1;                                       /* LCD Segment 11 Data Bit 3 */
  } Bits;
  struct {
    byte grpFP10BP :4;
    byte grpFP11BP :4;
  } MergedBits;
} LCDRAM5STR;
extern volatile LCDRAM5STR _LCDRAM5 @0x0000184D;
#define LCDRAM5                         _LCDRAM5.Byte
#define LCDRAM5_FP10BP0                 _LCDRAM5.Bits.FP10BP0
#define LCDRAM5_FP10BP1                 _LCDRAM5.Bits.FP10BP1
#define LCDRAM5_FP10BP2                 _LCDRAM5.Bits.FP10BP2
#define LCDRAM5_FP10BP3                 _LCDRAM5.Bits.FP10BP3
#define LCDRAM5_FP11BP0                 _LCDRAM5.Bits.FP11BP0
#define LCDRAM5_FP11BP1                 _LCDRAM5.Bits.FP11BP1
#define LCDRAM5_FP11BP2                 _LCDRAM5.Bits.FP11BP2
#define LCDRAM5_FP11BP3                 _LCDRAM5.Bits.FP11BP3
#define LCDRAM5_FP10BP                  _LCDRAM5.MergedBits.grpFP10BP
#define LCDRAM5_FP11BP                  _LCDRAM5.MergedBits.grpFP11BP

#define LCDRAM5_FP10BP0_MASK            1
#define LCDRAM5_FP10BP1_MASK            2
#define LCDRAM5_FP10BP2_MASK            4
#define LCDRAM5_FP10BP3_MASK            8
#define LCDRAM5_FP11BP0_MASK            16
#define LCDRAM5_FP11BP1_MASK            32
#define LCDRAM5_FP11BP2_MASK            64
#define LCDRAM5_FP11BP3_MASK            128
#define LCDRAM5_FP10BP_MASK             15
#define LCDRAM5_FP10BP_BITNUM           0
#define LCDRAM5_FP11BP_MASK             240
#define LCDRAM5_FP11BP_BITNUM           4


/*** LCDRAM6 - LCDRAM Register 6; 0x0000184E ***/
typedef union {
  byte Byte;
  struct {
    byte FP12BP0     :1;                                       /* LCD Segment 12 Data Bit 0 */
    byte FP12BP1     :1;                                       /* LCD Segment 12 Data Bit 1 */
    byte FP12BP2     :1;                                       /* LCD Segment 12 Data Bit 2 */
    byte FP12BP3     :1;                                       /* LCD Segment 12 Data Bit 3 */
    byte FP13BP0     :1;                                       /* LCD Segment 13 Data Bit 0 */
    byte FP13BP1     :1;                                       /* LCD Segment 13 Data Bit 1 */
    byte FP13BP2     :1;                                       /* LCD Segment 13 Data Bit 2 */
    byte FP13BP3     :1;                                       /* LCD Segment 13 Data Bit 3 */
  } Bits;
  struct {
    byte grpFP12BP :4;
    byte grpFP13BP :4;
  } MergedBits;
} LCDRAM6STR;
extern volatile LCDRAM6STR _LCDRAM6 @0x0000184E;
#define LCDRAM6                         _LCDRAM6.Byte
#define LCDRAM6_FP12BP0                 _LCDRAM6.Bits.FP12BP0
#define LCDRAM6_FP12BP1                 _LCDRAM6.Bits.FP12BP1
#define LCDRAM6_FP12BP2                 _LCDRAM6.Bits.FP12BP2
#define LCDRAM6_FP12BP3                 _LCDRAM6.Bits.FP12BP3
#define LCDRAM6_FP13BP0                 _LCDRAM6.Bits.FP13BP0
#define LCDRAM6_FP13BP1                 _LCDRAM6.Bits.FP13BP1
#define LCDRAM6_FP13BP2                 _LCDRAM6.Bits.FP13BP2
#define LCDRAM6_FP13BP3                 _LCDRAM6.Bits.FP13BP3
#define LCDRAM6_FP12BP                  _LCDRAM6.MergedBits.grpFP12BP
#define LCDRAM6_FP13BP                  _LCDRAM6.MergedBits.grpFP13BP

#define LCDRAM6_FP12BP0_MASK            1
#define LCDRAM6_FP12BP1_MASK            2
#define LCDRAM6_FP12BP2_MASK            4
#define LCDRAM6_FP12BP3_MASK            8
#define LCDRAM6_FP13BP0_MASK            16
#define LCDRAM6_FP13BP1_MASK            32
#define LCDRAM6_FP13BP2_MASK            64
#define LCDRAM6_FP13BP3_MASK            128
#define LCDRAM6_FP12BP_MASK             15
#define LCDRAM6_FP12BP_BITNUM           0
#define LCDRAM6_FP13BP_MASK             240
#define LCDRAM6_FP13BP_BITNUM           4


/*** LCDRAM7 - LCDRAM Register 7; 0x0000184F ***/
typedef union {
  byte Byte;
  struct {
    byte FP14BP0     :1;                                       /* LCD Segment 14 Data Bit 0 */
    byte FP14BP1     :1;                                       /* LCD Segment 14 Data Bit 1 */
    byte FP14BP2     :1;                                       /* LCD Segment 14 Data Bit 2 */
    byte FP14BP3     :1;                                       /* LCD Segment 14 Data Bit 3 */
    byte FP15BP0     :1;                                       /* LCD Segment 15 Data Bit 0 */
    byte FP15BP1     :1;                                       /* LCD Segment 15 Data Bit 1 */
    byte FP15BP2     :1;                                       /* LCD Segment 15 Data Bit 2 */
    byte FP15BP3     :1;                                       /* LCD Segment 15 Data Bit 3 */
  } Bits;
  struct {
    byte grpFP14BP :4;
    byte grpFP15BP :4;
  } MergedBits;
} LCDRAM7STR;
extern volatile LCDRAM7STR _LCDRAM7 @0x0000184F;
#define LCDRAM7                         _LCDRAM7.Byte
#define LCDRAM7_FP14BP0                 _LCDRAM7.Bits.FP14BP0
#define LCDRAM7_FP14BP1                 _LCDRAM7.Bits.FP14BP1
#define LCDRAM7_FP14BP2                 _LCDRAM7.Bits.FP14BP2
#define LCDRAM7_FP14BP3                 _LCDRAM7.Bits.FP14BP3
#define LCDRAM7_FP15BP0                 _LCDRAM7.Bits.FP15BP0
#define LCDRAM7_FP15BP1                 _LCDRAM7.Bits.FP15BP1
#define LCDRAM7_FP15BP2                 _LCDRAM7.Bits.FP15BP2
#define LCDRAM7_FP15BP3                 _LCDRAM7.Bits.FP15BP3
#define LCDRAM7_FP14BP                  _LCDRAM7.MergedBits.grpFP14BP
#define LCDRAM7_FP15BP                  _LCDRAM7.MergedBits.grpFP15BP

