vdtruong/temp_rh/mc9s08lc60.h
#define LCDRAM7_FP14BP0_MASK            1
#define LCDRAM7_FP14BP1_MASK            2
#define LCDRAM7_FP14BP2_MASK            4
#define LCDRAM7_FP14BP3_MASK            8
#define LCDRAM7_FP15BP0_MASK            16
#define LCDRAM7_FP15BP1_MASK            32
#define LCDRAM7_FP15BP2_MASK            64
#define LCDRAM7_FP15BP3_MASK            128
#define LCDRAM7_FP14BP_MASK             15
#define LCDRAM7_FP14BP_BITNUM           0
#define LCDRAM7_FP15BP_MASK             240
#define LCDRAM7_FP15BP_BITNUM           4


/*** LCDRAM8 - LCDRAM Register 8; 0x00001850 ***/
typedef union {
  byte Byte;
  struct {
    byte FP16BP0     :1;                                       /* LCD Segment 16 Data Bit 0 */
    byte FP16BP1     :1;                                       /* LCD Segment 16 Data Bit 1 */
    byte FP16BP2     :1;                                       /* LCD Segment 16 Data Bit 2 */
    byte FP16BP3     :1;                                       /* LCD Segment 16 Data Bit 3 */
    byte FP17BP0     :1;                                       /* LCD Segment 17 Data Bit 0 */
    byte FP17BP1     :1;                                       /* LCD Segment 17 Data Bit 1 */
    byte FP17BP2     :1;                                       /* LCD Segment 17 Data Bit 2 */
    byte FP17BP3     :1;                                       /* LCD Segment 17 Data Bit 3 */
  } Bits;
  struct {
    byte grpFP16BP :4;
    byte grpFP17BP :4;
  } MergedBits;
} LCDRAM8STR;
extern volatile LCDRAM8STR _LCDRAM8 @0x00001850;
#define LCDRAM8                         _LCDRAM8.Byte
#define LCDRAM8_FP16BP0                 _LCDRAM8.Bits.FP16BP0
#define LCDRAM8_FP16BP1                 _LCDRAM8.Bits.FP16BP1
#define LCDRAM8_FP16BP2                 _LCDRAM8.Bits.FP16BP2
#define LCDRAM8_FP16BP3                 _LCDRAM8.Bits.FP16BP3
#define LCDRAM8_FP17BP0                 _LCDRAM8.Bits.FP17BP0
#define LCDRAM8_FP17BP1                 _LCDRAM8.Bits.FP17BP1
#define LCDRAM8_FP17BP2                 _LCDRAM8.Bits.FP17BP2
#define LCDRAM8_FP17BP3                 _LCDRAM8.Bits.FP17BP3
#define LCDRAM8_FP16BP                  _LCDRAM8.MergedBits.grpFP16BP
#define LCDRAM8_FP17BP                  _LCDRAM8.MergedBits.grpFP17BP

#define LCDRAM8_FP16BP0_MASK            1
#define LCDRAM8_FP16BP1_MASK            2
#define LCDRAM8_FP16BP2_MASK            4
#define LCDRAM8_FP16BP3_MASK            8
#define LCDRAM8_FP17BP0_MASK            16
#define LCDRAM8_FP17BP1_MASK            32
#define LCDRAM8_FP17BP2_MASK            64
#define LCDRAM8_FP17BP3_MASK            128
#define LCDRAM8_FP16BP_MASK             15
#define LCDRAM8_FP16BP_BITNUM           0
#define LCDRAM8_FP17BP_MASK             240
#define LCDRAM8_FP17BP_BITNUM           4


/*** LCDRAM9 - LCDRAM Register 9; 0x00001851 ***/
typedef union {
  byte Byte;
  struct {
    byte FP18BP0     :1;                                       /* LCD Segment 18 Data Bit 0 */
    byte FP18BP1     :1;                                       /* LCD Segment 18 Data Bit 1 */
    byte FP18BP2     :1;                                       /* LCD Segment 18 Data Bit 2 */
    byte FP18BP3     :1;                                       /* LCD Segment 18 Data Bit 3 */
    byte FP19BP0     :1;                                       /* LCD Segment 19 Data Bit 0 */
    byte FP19BP1     :1;                                       /* LCD Segment 19 Data Bit 1 */
    byte FP19BP2     :1;                                       /* LCD Segment 19 Data Bit 2 */
    byte FP19BP3     :1;                                       /* LCD Segment 19 Data Bit 3 */
  } Bits;
  struct {
    byte grpFP18BP :4;
    byte grpFP19BP :4;
  } MergedBits;
} LCDRAM9STR;
extern volatile LCDRAM9STR _LCDRAM9 @0x00001851;
#define LCDRAM9                         _LCDRAM9.Byte
#define LCDRAM9_FP18BP0                 _LCDRAM9.Bits.FP18BP0
#define LCDRAM9_FP18BP1                 _LCDRAM9.Bits.FP18BP1
#define LCDRAM9_FP18BP2                 _LCDRAM9.Bits.FP18BP2
#define LCDRAM9_FP18BP3                 _LCDRAM9.Bits.FP18BP3
#define LCDRAM9_FP19BP0                 _LCDRAM9.Bits.FP19BP0
#define LCDRAM9_FP19BP1                 _LCDRAM9.Bits.FP19BP1
#define LCDRAM9_FP19BP2                 _LCDRAM9.Bits.FP19BP2
#define LCDRAM9_FP19BP3                 _LCDRAM9.Bits.FP19BP3
#define LCDRAM9_FP18BP                  _LCDRAM9.MergedBits.grpFP18BP
#define LCDRAM9_FP19BP                  _LCDRAM9.MergedBits.grpFP19BP

#define LCDRAM9_FP18BP0_MASK            1
#define LCDRAM9_FP18BP1_MASK            2
#define LCDRAM9_FP18BP2_MASK            4
#define LCDRAM9_FP18BP3_MASK            8
#define LCDRAM9_FP19BP0_MASK            16
#define LCDRAM9_FP19BP1_MASK            32
#define LCDRAM9_FP19BP2_MASK            64
#define LCDRAM9_FP19BP3_MASK            128
#define LCDRAM9_FP18BP_MASK             15
#define LCDRAM9_FP18BP_BITNUM           0
#define LCDRAM9_FP19BP_MASK             240
#define LCDRAM9_FP19BP_BITNUM           4


/*** LCDRAM10 - LCDRAM Register 10; 0x00001852 ***/
typedef union {
  byte Byte;
  struct {
    byte FP20BP0     :1;                                       /* LCD Segment 20 Data Bit 0 */
    byte FP20BP1     :1;                                       /* LCD Segment 20 Data Bit 1 */
    byte FP20BP2     :1;                                       /* LCD Segment 20 Data Bit 2 */
    byte FP20BP3     :1;                                       /* LCD Segment 20 Data Bit 3 */
    byte FP21BP0     :1;                                       /* LCD Segment 21 Data Bit 0 */
    byte FP21BP1     :1;                                       /* LCD Segment 21 Data Bit 1 */
    byte FP21BP2     :1;                                       /* LCD Segment 21 Data Bit 2 */
    byte FP21BP3     :1;                                       /* LCD Segment 21 Data Bit 3 */
  } Bits;
  struct {
    byte grpFP20BP :4;
    byte grpFP21BP :4;
  } MergedBits;
} LCDRAM10STR;
extern volatile LCDRAM10STR _LCDRAM10 @0x00001852;
#define LCDRAM10                        _LCDRAM10.Byte
#define LCDRAM10_FP20BP0                _LCDRAM10.Bits.FP20BP0
#define LCDRAM10_FP20BP1                _LCDRAM10.Bits.FP20BP1
#define LCDRAM10_FP20BP2                _LCDRAM10.Bits.FP20BP2
#define LCDRAM10_FP20BP3                _LCDRAM10.Bits.FP20BP3
#define LCDRAM10_FP21BP0                _LCDRAM10.Bits.FP21BP0
#define LCDRAM10_FP21BP1                _LCDRAM10.Bits.FP21BP1
#define LCDRAM10_FP21BP2                _LCDRAM10.Bits.FP21BP2
#define LCDRAM10_FP21BP3                _LCDRAM10.Bits.FP21BP3
#define LCDRAM10_FP20BP                 _LCDRAM10.MergedBits.grpFP20BP
#define LCDRAM10_FP21BP                 _LCDRAM10.MergedBits.grpFP21BP

#define LCDRAM10_FP20BP0_MASK           1
#define LCDRAM10_FP20BP1_MASK           2
#define LCDRAM10_FP20BP2_MASK           4
#define LCDRAM10_FP20BP3_MASK           8
#define LCDRAM10_FP21BP0_MASK           16
#define LCDRAM10_FP21BP1_MASK           32
#define LCDRAM10_FP21BP2_MASK           64
#define LCDRAM10_FP21BP3_MASK           128
#define LCDRAM10_FP20BP_MASK            15
#define LCDRAM10_FP20BP_BITNUM          0
#define LCDRAM10_FP21BP_MASK            240
#define LCDRAM10_FP21BP_BITNUM          4


/*** LCDRAM11 - LCDRAM Register 11; 0x00001853 ***/
typedef union {
  byte Byte;
  struct {
    byte FP22BP0     :1;                                       /* LCD Segment 22 Data Bit 0 */
    byte FP22BP1     :1;                                       /* LCD Segment 22 Data Bit 1 */
    byte FP22BP2     :1;                                       /* LCD Segment 22 Data Bit 2 */
    byte FP22BP3     :1;                                       /* LCD Segment 22 Data Bit 3 */
    byte FP23BP0     :1;                                       /* LCD Segment 23 Data Bit 0 */
    byte FP23BP1     :1;                                       /* LCD Segment 23 Data Bit 1 */
    byte FP23BP2     :1;                                       /* LCD Segment 23 Data Bit 2 */
    byte FP23BP3     :1;                                       /* LCD Segment 23 Data Bit 3 */
  } Bits;
  struct {
    byte grpFP22BP :4;
    byte grpFP23BP :4;
  } MergedBits;
} LCDRAM11STR;
extern volatile LCDRAM11STR _LCDRAM11 @0x00001853;
#define LCDRAM11                        _LCDRAM11.Byte
#define LCDRAM11_FP22BP0                _LCDRAM11.Bits.FP22BP0
#define LCDRAM11_FP22BP1                _LCDRAM11.Bits.FP22BP1
#define LCDRAM11_FP22BP2                _LCDRAM11.Bits.FP22BP2
#define LCDRAM11_FP22BP3                _LCDRAM11.Bits.FP22BP3
#define LCDRAM11_FP23BP0                _LCDRAM11.Bits.FP23BP0
#define LCDRAM11_FP23BP1                _LCDRAM11.Bits.FP23BP1
#define LCDRAM11_FP23BP2                _LCDRAM11.Bits.FP23BP2
#define LCDRAM11_FP23BP3                _LCDRAM11.Bits.FP23BP3
#define LCDRAM11_FP22BP                 _LCDRAM11.MergedBits.grpFP22BP
#define LCDRAM11_FP23BP                 _LCDRAM11.MergedBits.grpFP23BP

#define LCDRAM11_FP22BP0_MASK           1
#define LCDRAM11_FP22BP1_MASK           2
#define LCDRAM11_FP22BP2_MASK           4
#define LCDRAM11_FP22BP3_MASK           8
#define LCDRAM11_FP23BP0_MASK           16
#define LCDRAM11_FP23BP1_MASK           32
#define LCDRAM11_FP23BP2_MASK           64
#define LCDRAM11_FP23BP3_MASK           128
#define LCDRAM11_FP22BP_MASK            15
#define LCDRAM11_FP22BP_BITNUM          0
#define LCDRAM11_FP23BP_MASK            240
#define LCDRAM11_FP23BP_BITNUM          4


