vdtruong/temp_rh/mc9s08lc60.h
/*** LCDRAM12 - LCDRAM Register 12; 0x00001854 ***/
typedef union {
  byte Byte;
  struct {
    byte FP24BP0     :1;                                       /* LCD Segment 24 Data Bit 0 */
    byte FP24BP1     :1;                                       /* LCD Segment 24 Data Bit 1 */
    byte FP24BP2     :1;                                       /* LCD Segment 24 Data Bit 2 */
    byte FP24BP3     :1;                                       /* LCD Segment 24 Data Bit 3 */
    byte FP25BP0     :1;                                       /* LCD Segment 25 Data Bit 0 */
    byte FP25BP1     :1;                                       /* LCD Segment 25 Data Bit 1 */
    byte FP25BP2     :1;                                       /* LCD Segment 25 Data Bit 2 */
    byte FP25BP3     :1;                                       /* LCD Segment 25 Data Bit 3 */
  } Bits;
  struct {
    byte grpFP24BP :4;
    byte grpFP25BP :4;
  } MergedBits;
} LCDRAM12STR;
extern volatile LCDRAM12STR _LCDRAM12 @0x00001854;
#define LCDRAM12                        _LCDRAM12.Byte
#define LCDRAM12_FP24BP0                _LCDRAM12.Bits.FP24BP0
#define LCDRAM12_FP24BP1                _LCDRAM12.Bits.FP24BP1
#define LCDRAM12_FP24BP2                _LCDRAM12.Bits.FP24BP2
#define LCDRAM12_FP24BP3                _LCDRAM12.Bits.FP24BP3
#define LCDRAM12_FP25BP0                _LCDRAM12.Bits.FP25BP0
#define LCDRAM12_FP25BP1                _LCDRAM12.Bits.FP25BP1
#define LCDRAM12_FP25BP2                _LCDRAM12.Bits.FP25BP2
#define LCDRAM12_FP25BP3                _LCDRAM12.Bits.FP25BP3
#define LCDRAM12_FP24BP                 _LCDRAM12.MergedBits.grpFP24BP
#define LCDRAM12_FP25BP                 _LCDRAM12.MergedBits.grpFP25BP

#define LCDRAM12_FP24BP0_MASK           1
#define LCDRAM12_FP24BP1_MASK           2
#define LCDRAM12_FP24BP2_MASK           4
#define LCDRAM12_FP24BP3_MASK           8
#define LCDRAM12_FP25BP0_MASK           16
#define LCDRAM12_FP25BP1_MASK           32
#define LCDRAM12_FP25BP2_MASK           64
#define LCDRAM12_FP25BP3_MASK           128
#define LCDRAM12_FP24BP_MASK            15
#define LCDRAM12_FP24BP_BITNUM          0
#define LCDRAM12_FP25BP_MASK            240
#define LCDRAM12_FP25BP_BITNUM          4


/*** LCDRAM13 - LCDRAM Register 13; 0x00001855 ***/
typedef union {
  byte Byte;
  struct {
    byte FP26BP0     :1;                                       /* LCD Segment 26 Data Bit 0 */
    byte FP26BP1     :1;                                       /* LCD Segment 26 Data Bit 1 */
    byte FP26BP2     :1;                                       /* LCD Segment 26 Data Bit 2 */
    byte FP26BP3     :1;                                       /* LCD Segment 26 Data Bit 3 */
    byte FP27BP0     :1;                                       /* LCD Segment 27 Data Bit 0 */
    byte FP27BP1     :1;                                       /* LCD Segment 27 Data Bit 1 */
    byte FP27BP2     :1;                                       /* LCD Segment 27 Data Bit 2 */
    byte FP27BP3     :1;                                       /* LCD Segment 27 Data Bit 3 */
  } Bits;
  struct {
    byte grpFP26BP :4;
    byte grpFP27BP :4;
  } MergedBits;
} LCDRAM13STR;
extern volatile LCDRAM13STR _LCDRAM13 @0x00001855;
#define LCDRAM13                        _LCDRAM13.Byte
#define LCDRAM13_FP26BP0                _LCDRAM13.Bits.FP26BP0
#define LCDRAM13_FP26BP1                _LCDRAM13.Bits.FP26BP1
#define LCDRAM13_FP26BP2                _LCDRAM13.Bits.FP26BP2
#define LCDRAM13_FP26BP3                _LCDRAM13.Bits.FP26BP3
#define LCDRAM13_FP27BP0                _LCDRAM13.Bits.FP27BP0
#define LCDRAM13_FP27BP1                _LCDRAM13.Bits.FP27BP1
#define LCDRAM13_FP27BP2                _LCDRAM13.Bits.FP27BP2
#define LCDRAM13_FP27BP3                _LCDRAM13.Bits.FP27BP3
#define LCDRAM13_FP26BP                 _LCDRAM13.MergedBits.grpFP26BP
#define LCDRAM13_FP27BP                 _LCDRAM13.MergedBits.grpFP27BP

#define LCDRAM13_FP26BP0_MASK           1
#define LCDRAM13_FP26BP1_MASK           2
#define LCDRAM13_FP26BP2_MASK           4
#define LCDRAM13_FP26BP3_MASK           8
#define LCDRAM13_FP27BP0_MASK           16
#define LCDRAM13_FP27BP1_MASK           32
#define LCDRAM13_FP27BP2_MASK           64
#define LCDRAM13_FP27BP3_MASK           128
#define LCDRAM13_FP26BP_MASK            15
#define LCDRAM13_FP26BP_BITNUM          0
#define LCDRAM13_FP27BP_MASK            240
#define LCDRAM13_FP27BP_BITNUM          4


/*** LCDRAM14 - LCDRAM Register 14; 0x00001856 ***/
typedef union {
  byte Byte;
  struct {
    byte FP28BP0     :1;                                       /* LCD Segment 28 Data Bit 0 */
    byte FP28BP1     :1;                                       /* LCD Segment 28 Data Bit 1 */
    byte FP28BP2     :1;                                       /* LCD Segment 28 Data Bit 2 */
    byte FP28BP3     :1;                                       /* LCD Segment 28 Data Bit 3 */
    byte FP29BP0     :1;                                       /* LCD Segment 29 Data Bit 0 */
    byte FP29BP1     :1;                                       /* LCD Segment 29 Data Bit 1 */
    byte FP29BP2     :1;                                       /* LCD Segment 29 Data Bit 2 */
    byte FP29BP3     :1;                                       /* LCD Segment 29 Data Bit 3 */
  } Bits;
  struct {
    byte grpFP28BP :4;
    byte grpFP29BP :4;
  } MergedBits;
} LCDRAM14STR;
extern volatile LCDRAM14STR _LCDRAM14 @0x00001856;
#define LCDRAM14                        _LCDRAM14.Byte
#define LCDRAM14_FP28BP0                _LCDRAM14.Bits.FP28BP0
#define LCDRAM14_FP28BP1                _LCDRAM14.Bits.FP28BP1
#define LCDRAM14_FP28BP2                _LCDRAM14.Bits.FP28BP2
#define LCDRAM14_FP28BP3                _LCDRAM14.Bits.FP28BP3
#define LCDRAM14_FP29BP0                _LCDRAM14.Bits.FP29BP0
#define LCDRAM14_FP29BP1                _LCDRAM14.Bits.FP29BP1
#define LCDRAM14_FP29BP2                _LCDRAM14.Bits.FP29BP2
#define LCDRAM14_FP29BP3                _LCDRAM14.Bits.FP29BP3
#define LCDRAM14_FP28BP                 _LCDRAM14.MergedBits.grpFP28BP
#define LCDRAM14_FP29BP                 _LCDRAM14.MergedBits.grpFP29BP

#define LCDRAM14_FP28BP0_MASK           1
#define LCDRAM14_FP28BP1_MASK           2
#define LCDRAM14_FP28BP2_MASK           4
#define LCDRAM14_FP28BP3_MASK           8
#define LCDRAM14_FP29BP0_MASK           16
#define LCDRAM14_FP29BP1_MASK           32
#define LCDRAM14_FP29BP2_MASK           64
#define LCDRAM14_FP29BP3_MASK           128
#define LCDRAM14_FP28BP_MASK            15
#define LCDRAM14_FP28BP_BITNUM          0
#define LCDRAM14_FP29BP_MASK            240
#define LCDRAM14_FP29BP_BITNUM          4


