vdtruong/temp_rh/mc9s08lc60.h
/*** LCDRAM15 - LCDRAM Register 15; 0x00001857 ***/
typedef union {
  byte Byte;
  struct {
    byte FP30BP0     :1;                                       /* LCD Segment 30 Data Bit 0 */
    byte FP30BP1     :1;                                       /* LCD Segment 30 Data Bit 1 */
    byte FP30BP2     :1;                                       /* LCD Segment 30 Data Bit 2 */
    byte FP30BP3     :1;                                       /* LCD Segment 30 Data Bit 3 */
    byte FP31BP0     :1;                                       /* LCD Segment 31 Data Bit 0 */
    byte FP31BP1     :1;                                       /* LCD Segment 31 Data Bit 1 */
    byte FP31BP2     :1;                                       /* LCD Segment 31 Data Bit 2 */
    byte FP31BP3     :1;                                       /* LCD Segment 31 Data Bit 3 */
  } Bits;
  struct {
    byte grpFP30BP :4;
    byte grpFP31BP :4;
  } MergedBits;
} LCDRAM15STR;
extern volatile LCDRAM15STR _LCDRAM15 @0x00001857;
#define LCDRAM15                        _LCDRAM15.Byte
#define LCDRAM15_FP30BP0                _LCDRAM15.Bits.FP30BP0
#define LCDRAM15_FP30BP1                _LCDRAM15.Bits.FP30BP1
#define LCDRAM15_FP30BP2                _LCDRAM15.Bits.FP30BP2
#define LCDRAM15_FP30BP3                _LCDRAM15.Bits.FP30BP3
#define LCDRAM15_FP31BP0                _LCDRAM15.Bits.FP31BP0
#define LCDRAM15_FP31BP1                _LCDRAM15.Bits.FP31BP1
#define LCDRAM15_FP31BP2                _LCDRAM15.Bits.FP31BP2
#define LCDRAM15_FP31BP3                _LCDRAM15.Bits.FP31BP3
#define LCDRAM15_FP30BP                 _LCDRAM15.MergedBits.grpFP30BP
#define LCDRAM15_FP31BP                 _LCDRAM15.MergedBits.grpFP31BP

#define LCDRAM15_FP30BP0_MASK           1
#define LCDRAM15_FP30BP1_MASK           2
#define LCDRAM15_FP30BP2_MASK           4
#define LCDRAM15_FP30BP3_MASK           8
#define LCDRAM15_FP31BP0_MASK           16
#define LCDRAM15_FP31BP1_MASK           32
#define LCDRAM15_FP31BP2_MASK           64
#define LCDRAM15_FP31BP3_MASK           128
#define LCDRAM15_FP30BP_MASK            15
#define LCDRAM15_FP30BP_BITNUM          0
#define LCDRAM15_FP31BP_MASK            240
#define LCDRAM15_FP31BP_BITNUM          4


/*** LCDRAM16 - LCDRAM Register 16; 0x00001858 ***/
typedef union {
  byte Byte;
  struct {
    byte FP32BP0     :1;                                       /* LCD Segment 32 Data Bit 0 */
    byte FP32BP1     :1;                                       /* LCD Segment 32 Data Bit 1 */
    byte FP32BP2     :1;                                       /* LCD Segment 32 Data Bit 2 */
    byte FP32BP3     :1;                                       /* LCD Segment 32 Data Bit 3 */
    byte FP33BP0     :1;                                       /* LCD Segment 33 Data Bit 0 */
    byte FP33BP1     :1;                                       /* LCD Segment 33 Data Bit 1 */
    byte FP33BP2     :1;                                       /* LCD Segment 33 Data Bit 2 */
    byte FP33BP3     :1;                                       /* LCD Segment 33 Data Bit 3 */
  } Bits;
  struct {
    byte grpFP32BP :4;
    byte grpFP33BP :4;
  } MergedBits;
} LCDRAM16STR;
extern volatile LCDRAM16STR _LCDRAM16 @0x00001858;
#define LCDRAM16                        _LCDRAM16.Byte
#define LCDRAM16_FP32BP0                _LCDRAM16.Bits.FP32BP0
#define LCDRAM16_FP32BP1                _LCDRAM16.Bits.FP32BP1
#define LCDRAM16_FP32BP2                _LCDRAM16.Bits.FP32BP2
#define LCDRAM16_FP32BP3                _LCDRAM16.Bits.FP32BP3
#define LCDRAM16_FP33BP0                _LCDRAM16.Bits.FP33BP0
#define LCDRAM16_FP33BP1                _LCDRAM16.Bits.FP33BP1
#define LCDRAM16_FP33BP2                _LCDRAM16.Bits.FP33BP2
#define LCDRAM16_FP33BP3                _LCDRAM16.Bits.FP33BP3
#define LCDRAM16_FP32BP                 _LCDRAM16.MergedBits.grpFP32BP
#define LCDRAM16_FP33BP                 _LCDRAM16.MergedBits.grpFP33BP

#define LCDRAM16_FP32BP0_MASK           1
#define LCDRAM16_FP32BP1_MASK           2
#define LCDRAM16_FP32BP2_MASK           4
#define LCDRAM16_FP32BP3_MASK           8
#define LCDRAM16_FP33BP0_MASK           16
#define LCDRAM16_FP33BP1_MASK           32
#define LCDRAM16_FP33BP2_MASK           64
#define LCDRAM16_FP33BP3_MASK           128
#define LCDRAM16_FP32BP_MASK            15
#define LCDRAM16_FP32BP_BITNUM          0
#define LCDRAM16_FP33BP_MASK            240
#define LCDRAM16_FP33BP_BITNUM          4


/*** LCDRAM17 - LCDRAM Register 17; 0x00001859 ***/
typedef union {
  byte Byte;
  struct {
    byte FP34BP0     :1;                                       /* LCD Segment 34 Data Bit 0 */
    byte FP34BP1     :1;                                       /* LCD Segment 34 Data Bit 1 */
    byte FP34BP2     :1;                                       /* LCD Segment 34 Data Bit 2 */
    byte FP34BP3     :1;                                       /* LCD Segment 34 Data Bit 3 */
    byte FP35BP0     :1;                                       /* LCD Segment 35 Data Bit 0 */
    byte FP35BP1     :1;                                       /* LCD Segment 35 Data Bit 1 */
    byte FP35BP2     :1;                                       /* LCD Segment 35 Data Bit 2 */
    byte FP35BP3     :1;                                       /* LCD Segment 35 Data Bit 3 */
  } Bits;
  struct {
    byte grpFP34BP :4;
    byte grpFP35BP :4;
  } MergedBits;
} LCDRAM17STR;
extern volatile LCDRAM17STR _LCDRAM17 @0x00001859;
#define LCDRAM17                        _LCDRAM17.Byte
#define LCDRAM17_FP34BP0                _LCDRAM17.Bits.FP34BP0
#define LCDRAM17_FP34BP1                _LCDRAM17.Bits.FP34BP1
#define LCDRAM17_FP34BP2                _LCDRAM17.Bits.FP34BP2
#define LCDRAM17_FP34BP3                _LCDRAM17.Bits.FP34BP3
#define LCDRAM17_FP35BP0                _LCDRAM17.Bits.FP35BP0
#define LCDRAM17_FP35BP1                _LCDRAM17.Bits.FP35BP1
#define LCDRAM17_FP35BP2                _LCDRAM17.Bits.FP35BP2
#define LCDRAM17_FP35BP3                _LCDRAM17.Bits.FP35BP3
#define LCDRAM17_FP34BP                 _LCDRAM17.MergedBits.grpFP34BP
#define LCDRAM17_FP35BP                 _LCDRAM17.MergedBits.grpFP35BP

#define LCDRAM17_FP34BP0_MASK           1
#define LCDRAM17_FP34BP1_MASK           2
#define LCDRAM17_FP34BP2_MASK           4
#define LCDRAM17_FP34BP3_MASK           8
#define LCDRAM17_FP35BP0_MASK           16
#define LCDRAM17_FP35BP1_MASK           32
#define LCDRAM17_FP35BP2_MASK           64
#define LCDRAM17_FP35BP3_MASK           128
#define LCDRAM17_FP34BP_MASK            15
#define LCDRAM17_FP34BP_BITNUM          0
#define LCDRAM17_FP35BP_MASK            240
#define LCDRAM17_FP35BP_BITNUM          4


