vdtruong/temp_rh/mc9s08lc60.h
/*** LCDRAM18 - LCDRAM Register 18; 0x0000185A ***/
typedef union {
  byte Byte;
  struct {
    byte FP36BP0     :1;                                       /* LCD Segment 36 Data Bit 0 */
    byte FP36BP1     :1;                                       /* LCD Segment 36 Data Bit 1 */
    byte FP36BP2     :1;                                       /* LCD Segment 36 Data Bit 2 */
    byte FP36BP3     :1;                                       /* LCD Segment 36 Data Bit 3 */
    byte FP37BP0     :1;                                       /* LCD Segment 37 Data Bit 0 */
    byte FP37BP1     :1;                                       /* LCD Segment 37 Data Bit 1 */
    byte FP37BP2     :1;                                       /* LCD Segment 37 Data Bit 2 */
    byte FP37BP3     :1;                                       /* LCD Segment 37 Data Bit 3 */
  } Bits;
  struct {
    byte grpFP36BP :4;
    byte grpFP37BP :4;
  } MergedBits;
} LCDRAM18STR;
extern volatile LCDRAM18STR _LCDRAM18 @0x0000185A;
#define LCDRAM18                        _LCDRAM18.Byte
#define LCDRAM18_FP36BP0                _LCDRAM18.Bits.FP36BP0
#define LCDRAM18_FP36BP1                _LCDRAM18.Bits.FP36BP1
#define LCDRAM18_FP36BP2                _LCDRAM18.Bits.FP36BP2
#define LCDRAM18_FP36BP3                _LCDRAM18.Bits.FP36BP3
#define LCDRAM18_FP37BP0                _LCDRAM18.Bits.FP37BP0
#define LCDRAM18_FP37BP1                _LCDRAM18.Bits.FP37BP1
#define LCDRAM18_FP37BP2                _LCDRAM18.Bits.FP37BP2
#define LCDRAM18_FP37BP3                _LCDRAM18.Bits.FP37BP3
#define LCDRAM18_FP36BP                 _LCDRAM18.MergedBits.grpFP36BP
#define LCDRAM18_FP37BP                 _LCDRAM18.MergedBits.grpFP37BP

#define LCDRAM18_FP36BP0_MASK           1
#define LCDRAM18_FP36BP1_MASK           2
#define LCDRAM18_FP36BP2_MASK           4
#define LCDRAM18_FP36BP3_MASK           8
#define LCDRAM18_FP37BP0_MASK           16
#define LCDRAM18_FP37BP1_MASK           32
#define LCDRAM18_FP37BP2_MASK           64
#define LCDRAM18_FP37BP3_MASK           128
#define LCDRAM18_FP36BP_MASK            15
#define LCDRAM18_FP36BP_BITNUM          0
#define LCDRAM18_FP37BP_MASK            240
#define LCDRAM18_FP37BP_BITNUM          4


/*** LCDRAM19 - LCDRAM Register 19; 0x0000185B ***/
typedef union {
  byte Byte;
  struct {
    byte FP38BP0     :1;                                       /* LCD Segment 38 Data Bit 0 */
    byte FP38BP1     :1;                                       /* LCD Segment 38 Data Bit 1 */
    byte FP38BP2     :1;                                       /* LCD Segment 38 Data Bit 2 */
    byte FP38BP3     :1;                                       /* LCD Segment 38 Data Bit 3 */
    byte FP39BP0     :1;                                       /* LCD Segment 39 Data Bit 0 */
    byte FP39BP1     :1;                                       /* LCD Segment 39 Data Bit 1 */
    byte FP39BP2     :1;                                       /* LCD Segment 39 Data Bit 2 */
    byte FP39BP3     :1;                                       /* LCD Segment 39 Data Bit 3 */
  } Bits;
  struct {
    byte grpFP38BP :4;
    byte grpFP39BP :4;
  } MergedBits;
} LCDRAM19STR;
extern volatile LCDRAM19STR _LCDRAM19 @0x0000185B;
#define LCDRAM19                        _LCDRAM19.Byte
#define LCDRAM19_FP38BP0                _LCDRAM19.Bits.FP38BP0
#define LCDRAM19_FP38BP1                _LCDRAM19.Bits.FP38BP1
#define LCDRAM19_FP38BP2                _LCDRAM19.Bits.FP38BP2
#define LCDRAM19_FP38BP3                _LCDRAM19.Bits.FP38BP3
#define LCDRAM19_FP39BP0                _LCDRAM19.Bits.FP39BP0
#define LCDRAM19_FP39BP1                _LCDRAM19.Bits.FP39BP1
#define LCDRAM19_FP39BP2                _LCDRAM19.Bits.FP39BP2
#define LCDRAM19_FP39BP3                _LCDRAM19.Bits.FP39BP3
#define LCDRAM19_FP38BP                 _LCDRAM19.MergedBits.grpFP38BP
#define LCDRAM19_FP39BP                 _LCDRAM19.MergedBits.grpFP39BP

#define LCDRAM19_FP38BP0_MASK           1
#define LCDRAM19_FP38BP1_MASK           2
#define LCDRAM19_FP38BP2_MASK           4
#define LCDRAM19_FP38BP3_MASK           8
#define LCDRAM19_FP39BP0_MASK           16
#define LCDRAM19_FP39BP1_MASK           32
#define LCDRAM19_FP39BP2_MASK           64
#define LCDRAM19_FP39BP3_MASK           128
#define LCDRAM19_FP38BP_MASK            15
#define LCDRAM19_FP38BP_BITNUM          0
#define LCDRAM19_FP39BP_MASK            240
#define LCDRAM19_FP39BP_BITNUM          4


/*** LCDRAM20 - LCDRAM Register 20; 0x0000185C ***/
typedef union {
  byte Byte;
  struct {
    byte FP40BP0     :1;                                       /* LCD Segment 40 Data Bit 0 */
    byte FP40BP1     :1;                                       /* LCD Segment 40 Data Bit 1 */
    byte FP40BP2     :1;                                       /* LCD Segment 40 Data Bit 2 */
    byte FP40BP3     :1;                                       /* LCD Segment 40 Data Bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpFP40BP :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} LCDRAM20STR;
extern volatile LCDRAM20STR _LCDRAM20 @0x0000185C;
#define LCDRAM20                        _LCDRAM20.Byte
#define LCDRAM20_FP40BP0                _LCDRAM20.Bits.FP40BP0
#define LCDRAM20_FP40BP1                _LCDRAM20.Bits.FP40BP1
#define LCDRAM20_FP40BP2                _LCDRAM20.Bits.FP40BP2
#define LCDRAM20_FP40BP3                _LCDRAM20.Bits.FP40BP3
#define LCDRAM20_FP40BP                 _LCDRAM20.MergedBits.grpFP40BP

#define LCDRAM20_FP40BP0_MASK           1
#define LCDRAM20_FP40BP1_MASK           2
#define LCDRAM20_FP40BP2_MASK           4
#define LCDRAM20_FP40BP3_MASK           8
#define LCDRAM20_FP40BP_MASK            15
#define LCDRAM20_FP40BP_BITNUM          0


/*** LCDCLKS - LCD Clock Source Register; 0x00001862 ***/
typedef union {
  byte Byte;
  struct {
    byte CLKADJ0     :1;                                       /* LCD Clock Source Divider Bit 0 */
    byte CLKADJ1     :1;                                       /* LCD Clock Source Divider Bit 1 */
    byte CLKADJ2     :1;                                       /* LCD Clock Source Divider Bit 2 */
    byte CLKADJ3     :1;                                       /* LCD Clock Source Divider Bit 3 */
    byte CLKADJ4     :1;                                       /* LCD Clock Source Divider Bit 4 */
    byte CLKADJ5     :1;                                       /* LCD Clock Source Divider Bit 5 */
    byte DIV16       :1;                                       /* LCD Clock Prescaler Enable */
    byte SOURCE      :1;                                       /* LCD Clock Source Select */
  } Bits;
  struct {
    byte grpCLKADJ :6;
    byte grpDIV_16 :1;
    byte         :1;
  } MergedBits;
} LCDCLKSSTR;
extern volatile LCDCLKSSTR _LCDCLKS @0x00001862;
#define LCDCLKS                         _LCDCLKS.Byte
#define LCDCLKS_CLKADJ0                 _LCDCLKS.Bits.CLKADJ0
#define LCDCLKS_CLKADJ1                 _LCDCLKS.Bits.CLKADJ1
#define LCDCLKS_CLKADJ2                 _LCDCLKS.Bits.CLKADJ2
#define LCDCLKS_CLKADJ3                 _LCDCLKS.Bits.CLKADJ3
#define LCDCLKS_CLKADJ4                 _LCDCLKS.Bits.CLKADJ4
#define LCDCLKS_CLKADJ5                 _LCDCLKS.Bits.CLKADJ5
#define LCDCLKS_DIV16                   _LCDCLKS.Bits.DIV16
#define LCDCLKS_SOURCE                  _LCDCLKS.Bits.SOURCE
#define LCDCLKS_CLKADJ                  _LCDCLKS.MergedBits.grpCLKADJ

#define LCDCLKS_CLKADJ0_MASK            1
#define LCDCLKS_CLKADJ1_MASK            2
#define LCDCLKS_CLKADJ2_MASK            4
#define LCDCLKS_CLKADJ3_MASK            8
#define LCDCLKS_CLKADJ4_MASK            16
#define LCDCLKS_CLKADJ5_MASK            32
#define LCDCLKS_DIV16_MASK              64
#define LCDCLKS_SOURCE_MASK             128
#define LCDCLKS_CLKADJ_MASK             63
#define LCDCLKS_CLKADJ_BITNUM           0


