vdtruong/temp_rh/mc9s08lc60.h
/*** LCDSUPPLY - LCD Voltage Supply Register; 0x00001863 ***/
typedef union {
  byte Byte;
  struct {
    byte VSUPPLY0    :1;                                       /* Blink Rate Configuration Bit 0 */
    byte VSUPPLY1    :1;                                       /* Blink Rate Configuration Bit 1 */
    byte BBYPASS     :1;                                       /* Op Amp Control */
    byte             :1; 
    byte CPCADJ0     :1;                                       /* LCD Module Charge Pump Clock Adjust Bit 0 */
    byte CPCADJ1     :1;                                       /* LCD Module Charge Pump Clock Adjust Bit 1 */
    byte LCDCPMS     :1;                                       /* LCD Module Charge Pump Mode Select */
    byte LCDCPEN     :1;                                       /* LCD Module Charge Pump Enable */
  } Bits;
  struct {
    byte grpVSUPPLY :2;
    byte         :1;
    byte         :1;
    byte grpCPCADJ :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} LCDSUPPLYSTR;
extern volatile LCDSUPPLYSTR _LCDSUPPLY @0x00001863;
#define LCDSUPPLY                       _LCDSUPPLY.Byte
#define LCDSUPPLY_VSUPPLY0              _LCDSUPPLY.Bits.VSUPPLY0
#define LCDSUPPLY_VSUPPLY1              _LCDSUPPLY.Bits.VSUPPLY1
#define LCDSUPPLY_BBYPASS               _LCDSUPPLY.Bits.BBYPASS
#define LCDSUPPLY_CPCADJ0               _LCDSUPPLY.Bits.CPCADJ0
#define LCDSUPPLY_CPCADJ1               _LCDSUPPLY.Bits.CPCADJ1
#define LCDSUPPLY_LCDCPMS               _LCDSUPPLY.Bits.LCDCPMS
#define LCDSUPPLY_LCDCPEN               _LCDSUPPLY.Bits.LCDCPEN
#define LCDSUPPLY_VSUPPLY               _LCDSUPPLY.MergedBits.grpVSUPPLY
#define LCDSUPPLY_CPCADJ                _LCDSUPPLY.MergedBits.grpCPCADJ

#define LCDSUPPLY_VSUPPLY0_MASK         1
#define LCDSUPPLY_VSUPPLY1_MASK         2
#define LCDSUPPLY_BBYPASS_MASK          4
#define LCDSUPPLY_CPCADJ0_MASK          16
#define LCDSUPPLY_CPCADJ1_MASK          32
#define LCDSUPPLY_LCDCPMS_MASK          64
#define LCDSUPPLY_LCDCPEN_MASK          128
#define LCDSUPPLY_VSUPPLY_MASK          3
#define LCDSUPPLY_VSUPPLY_BITNUM        0
#define LCDSUPPLY_CPCADJ_MASK           48
#define LCDSUPPLY_CPCADJ_BITNUM         4


/*** LCDBCTL - LCD Blink Control Register; 0x00001864 ***/
typedef union {
  byte Byte;
  struct {
    byte BRATE0      :1;                                       /* Blink Rate Configuration Bit 0 */
    byte BRATE1      :1;                                       /* Blink Rate Configuration Bit 1 */
    byte BRATE2      :1;                                       /* Blink Rate Configuration Bit 2 */
    byte BLKMODE     :1;                                       /* Blink Mode Select */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte BLINK       :1;                                       /* Blink Command */
  } Bits;
  struct {
    byte grpBRATE :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} LCDBCTLSTR;
extern volatile LCDBCTLSTR _LCDBCTL @0x00001864;
#define LCDBCTL                         _LCDBCTL.Byte
#define LCDBCTL_BRATE0                  _LCDBCTL.Bits.BRATE0
#define LCDBCTL_BRATE1                  _LCDBCTL.Bits.BRATE1
#define LCDBCTL_BRATE2                  _LCDBCTL.Bits.BRATE2
#define LCDBCTL_BLKMODE                 _LCDBCTL.Bits.BLKMODE
#define LCDBCTL_BLINK                   _LCDBCTL.Bits.BLINK
#define LCDBCTL_BRATE                   _LCDBCTL.MergedBits.grpBRATE

#define LCDBCTL_BRATE0_MASK             1
#define LCDBCTL_BRATE1_MASK             2
#define LCDBCTL_BRATE2_MASK             4
#define LCDBCTL_BLKMODE_MASK            8
#define LCDBCTL_BLINK_MASK              128
#define LCDBCTL_BRATE_MASK              7
#define LCDBCTL_BRATE_BITNUM            0


/*** LCDCMD - LCD Command and Status Register; 0x00001865 ***/
typedef union {
  byte Byte;
  struct {
    byte BLANK       :1;                                       /* LCD Display Blank Command */
    byte LCDCLR      :1;                                       /* LCD Data Register Clear Command */
    byte             :1; 
    byte LCDDRMS     :1;                                       /* LCD Module Data Register Mode Select */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte LCDIF       :1;                                       /* LCD Interrupt Flag */
  } Bits;
} LCDCMDSTR;
extern volatile LCDCMDSTR _LCDCMD @0x00001865;
#define LCDCMD                          _LCDCMD.Byte
#define LCDCMD_BLANK                    _LCDCMD.Bits.BLANK
#define LCDCMD_LCDCLR                   _LCDCMD.Bits.LCDCLR
#define LCDCMD_LCDDRMS                  _LCDCMD.Bits.LCDDRMS
#define LCDCMD_LCDIF                    _LCDCMD.Bits.LCDIF

#define LCDCMD_BLANK_MASK               1
#define LCDCMD_LCDCLR_MASK              2
#define LCDCMD_LCDDRMS_MASK             8
#define LCDCMD_LCDIF_MASK               128


/*** NVBACKKEY0 - Backdoor Comparison Key 0; 0x0000FFB0 ***/
typedef union {
  byte Byte;
  struct {
    byte KEY0        :1;                                       /* Backdoor Comparison Key bits, bit 0 */
    byte KEY1        :1;                                       /* Backdoor Comparison Key bits, bit 1 */
    byte KEY2        :1;                                       /* Backdoor Comparison Key bits, bit 2 */
    byte KEY3        :1;                                       /* Backdoor Comparison Key bits, bit 3 */
    byte KEY4        :1;                                       /* Backdoor Comparison Key bits, bit 4 */
    byte KEY5        :1;                                       /* Backdoor Comparison Key bits, bit 5 */
    byte KEY6        :1;                                       /* Backdoor Comparison Key bits, bit 6 */
    byte KEY7        :1;                                       /* Backdoor Comparison Key bits, bit 7 */
  } Bits;
} NVBACKKEY0STR;
/* Tip for register initialization in the user code:  const byte NVBACKKEY0_INIT @0x0000FFB0 = <NVBACKKEY0_INITVAL>; */
#define _NVBACKKEY0 (*(const NVBACKKEY0STR * __far)0x0000FFB0)
#define NVBACKKEY0                      _NVBACKKEY0.Byte
#define NVBACKKEY0_KEY0                 _NVBACKKEY0.Bits.KEY0
#define NVBACKKEY0_KEY1                 _NVBACKKEY0.Bits.KEY1
#define NVBACKKEY0_KEY2                 _NVBACKKEY0.Bits.KEY2
#define NVBACKKEY0_KEY3                 _NVBACKKEY0.Bits.KEY3
#define NVBACKKEY0_KEY4                 _NVBACKKEY0.Bits.KEY4
#define NVBACKKEY0_KEY5                 _NVBACKKEY0.Bits.KEY5
#define NVBACKKEY0_KEY6                 _NVBACKKEY0.Bits.KEY6
#define NVBACKKEY0_KEY7                 _NVBACKKEY0.Bits.KEY7
/* NVBACKKEY_ARR: Access 8 NVBACKKEYx registers in an array */
#define NVBACKKEY_ARR                   ((volatile byte * __far) &NVBACKKEY0)

